In [1]:
import pandas as pd
counties = pd.read_html('https://www.newyork-demographics.com/counties_by_population')
county_data=counties[0]
county_data["County"]=[county.replace(" County","").strip() for county in county_data["County"]]
county_data["County"]
county_data = county_data[county_data.County.str.contains('United States Census') == False]
county_data["County"]
county_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 62 entries, 0 to 61
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Rank        62 non-null     object
 1   County      62 non-null     object
 2   Population  62 non-null     object
dtypes: object(3)
memory usage: 1.9+ KB

In [2]:
import pandas as pd
data=pd.read_csv("unemp.csv")
data.head()

,Year,Month,Region,County,Beneficiaries,Benefit Amounts (Dollars)
0,2020,6,Capital,Albany,"17,500","24,070,000"
1,2020,6,Western New York,Allegany,"2,200","2,680,000"
2,2020,6,New York City,Bronx,"145,400","249,000,000"
3,2020,6,Southern Tier,Broome,"11,900","13,890,000"
4,2020,6,Western New York,Cattaraugus,"5,500","6,680,000"

In [3]:
county_clean=pd.merge(county_data, data, how='inner', on='County', left_on=None, right_on=None,
         left_index=False, right_index=False, sort=True,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)

In [4]:
county_clean.info()
county_clean.iloc[:,6]= [int(amount.replace(",","").strip()) for amount in
                                            county_clean.iloc[:,6]]
county_clean.iloc[:,7]= [int(amount.replace(",","").strip()) for amount in
                                            county_clean.iloc[:,7]]
county_clean["Average Benefits per Beneficiary"]=county_clean.iloc[:,7]/county_clean.iloc[:,6] #need to convert to int
county_clean.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14508 entries, 0 to 14507
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Rank                         14508 non-null  object
 1   County                       14508 non-null  object
 2   Population                   14508 non-null  object
 3   Year                         14508 non-null  int64
 4   Month                        14508 non-null  int64
 5   Region                       14508 non-null  object
 6   Beneficiaries                14508 non-null  object
 7    Benefit Amounts (Dollars)   14508 non-null  object
dtypes: int64(2), object(6)
memory usage: 1020.1+ KB

,Rank,County,Population,Year,Month,Region,Beneficiaries,Benefit Amounts (Dollars),Average Benefits per Beneficiary
0,14,Albany,305506,2020,6,Capital,17500,24070000,1375.428571
1,14,Albany,305506,2020,5,Capital,16900,20690000,1224.260355
2,14,Albany,305506,2020,4,Capital,13300,15920000,1196.992481
3,14,Albany,305506,2020,3,Capital,4700,4020000,855.319149
4,14,Albany,305506,2020,2,Capital,2100,2350000,1119.047619

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14976 entries, 0 to 14975
Data columns (total 6 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Year                         14976 non-null  int64
 1   Month                        14976 non-null  int64
 2   Region                       14976 non-null  object
 3   County                       14976 non-null  object
 4   Beneficiaries                14976 non-null  object
 5    Benefit Amounts (Dollars)   14976 non-null  object
dtypes: int64(2), object(4)
memory usage: 702.1+ KB

In [6]:
import pandas as pd
inf_data=pd.read_html('https://www.usinflationcalculator.com/inflation/consumer-price-index-and-annual-percent-changes-from-1913-to-2008/')[0]
inf_data

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Annual,Percent Change,Percent Change
1,Year,Jan,Feb,Mar,Apr,May,June,July,Aug,Sep,Oct,Nov,Dec,Avg,Dec-Dec,Avg-Avg
2,1913,9.8,9.8,9.8,9.8,9.7,9.8,9.9,9.9,10.0,10.0,10.1,10.0,9.9,–,–
3,1914,10.0,9.9,9.9,9.8,9.9,9.9,10.0,10.2,10.2,10.1,10.2,10.1,10.0,1.0,1.0
4,1915,10.1,10.0,9.9,10.0,10.1,10.1,10.1,10.1,10.1,10.2,10.3,10.3,10.1,2.0,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
105,2016,236.916,237.111,238.132,239.261,240.236,241.038,240.647,240.853,241.428,241.729,241.353,241.432,240.007,2.1,1.3
106,2017,242.839,243.603,243.801,244.524,244.733,244.955,244.786,245.519,246.819,246.663,246.669,246.524,245.120,2.1,2.1
107,2018,247.867,248.991,249.554,250.546,251.588,251.989,252.006,252.146,252.439,252.885,252.038,251.233,251.107,1.9,2.4
108,2019,251.712,252.776,254.202,255.548,256.092,256.143,256.571,256.558,256.759,257.346,257.208,256.974,255.657,2.3,1.8
109,2020,257.971,258.678,258.115,256.389,256.394,257.797,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
inf_data.columns=inf_data.iloc[1]
#data=data.set_index(0)
inf_data=inf_data.iloc[2:,0:13]
inf_data

1,Year,Jan,Feb,Mar,Apr,May,June,July,Aug,Sep,Oct,Nov,Dec
2,1913,9.8,9.8,9.8,9.8,9.7,9.8,9.9,9.9,10.0,10.0,10.1,10.0
3,1914,10.0,9.9,9.9,9.8,9.9,9.9,10.0,10.2,10.2,10.1,10.2,10.1
4,1915,10.1,10.0,9.9,10.0,10.1,10.1,10.1,10.1,10.1,10.2,10.3,10.3
5,1916,10.4,10.4,10.5,10.6,10.7,10.8,10.8,10.9,11.1,11.3,11.5,11.6
6,1917,11.7,12.0,12.0,12.6,12.8,13.0,12.8,13.0,13.3,13.5,13.5,13.7
...,...,...,...,...,...,...,...,...,...,...,...,...,...
105,2016,236.916,237.111,238.132,239.261,240.236,241.038,240.647,240.853,241.428,241.729,241.353,241.432
106,2017,242.839,243.603,243.801,244.524,244.733,244.955,244.786,245.519,246.819,246.663,246.669,246.524
107,2018,247.867,248.991,249.554,250.546,251.588,251.989,252.006,252.146,252.439,252.885,252.038,251.233
108,2019,251.712,252.776,254.202,255.548,256.092,256.143,256.571,256.558,256.759,257.346,257.208,256.974
109,2020,257.971,258.678,258.115,256.389,256.394,257.797,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
inf_data=inf_data.melt(id_vars=['Year'], value_vars=inf_data.columns[1:])
inf_data

      Year    1    value
0     1913  Jan      9.8
1     1914  Jan     10.0
2     1915  Jan     10.1
3     1916  Jan     10.4
4     1917  Jan     11.7
...    ...  ...      ...
1291  2016  Dec  241.432
1292  2017  Dec  246.524
1293  2018  Dec  251.233
1294  2019  Dec  256.974
1295  2020  Dec      NaN

[1296 rows x 3 columns]

In [9]:
inf_data["Year"]=[int(year)for year in inf_data["Year"]]

In [10]:
inf_data=inf_data[inf_data["Year"]>=2000]

In [11]:
inf_data.head()

    Year    1  value
87  2000  Jan  168.8
88  2001  Jan  175.1
89  2002  Jan  177.1
90  2003  Jan  181.7
91  2004  Jan  185.2

In [13]:
county_clean=pd.merge(county_clean, inf_data, how='inner', on='County', left_on=None, right_on=None,
         left_index=False, right_index=False, sort=True,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)

KeyError: 'County'

In [14]:
inf_data=inf_data.sort_values("Year")
inf_data

      Year     1    value
87    2000   Jan    168.8
627   2000  June    172.4
1275  2000   Dec    174.0
195   2000   Feb    169.8
1059  2000   Oct    174.0
...    ...   ...      ...
1079  2020   Oct      NaN
647   2020  June  257.797
1187  2020   Nov      NaN
755   2020  July      NaN
1295  2020   Dec      NaN

[252 rows x 3 columns]

In [26]:
inf_data = inf_data.replace(["Jan","Feb", "Mar", "April", "May", "June", "July", "Aug", "Sep", "Oct", "Nov", "Dec"],[1,2,3,4,5,6,7,8,9,10,11,12])

In [29]:
inf_data = inf_data.rename(columns={1: "Month"})

In [30]:
county_clean=pd.merge(county_clean, inf_data, how='left', on=['Year','Month'], left_on=None, right_on=None,
         left_index=False, right_index=False, sort=True,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)

In [32]:
county_clean.head()

,Rank,County,Population,Year,Month,Region,Beneficiaries,Benefit Amounts (Dollars),Average Benefits per Beneficiary,value
0,14,Albany,305506,2001,1,Capital,2500,2390000,956.000000,175.1
1,52,Allegany,46091,2001,1,Western New York,800,830000,1037.500000,175.1
2,5,Bronx,1418207,2001,1,New York City,13800,12290000,890.579710,175.1
3,19,Broome,190488,2001,1,Southern Tier,2500,2200000,880.000000,175.1
4,35,Cattaraugus,76117,2001,1,Western New York,1700,1620000,952.941176,175.1

In [34]:
county_clean = county_clean.rename(columns={'value': 'Inflation Rate'})
county_clean.head()

,Rank,County,Population,Year,Month,Region,Beneficiaries,Benefit Amounts (Dollars),Average Benefits per Beneficiary,Inflation Rate
0,14,Albany,305506,2001,1,Capital,2500,2390000,956.000000,175.1
1,52,Allegany,46091,2001,1,Western New York,800,830000,1037.500000,175.1
2,5,Bronx,1418207,2001,1,New York City,13800,12290000,890.579710,175.1
3,19,Broome,190488,2001,1,Southern Tier,2500,2200000,880.000000,175.1
4,35,Cattaraugus,76117,2001,1,Western New York,1700,1620000,952.941176,175.1